import styles from "./List.module.css";
import { ListItem } from "./ListItem";

export function List() {
  return (
    <div className={styles.component}>
      {links.map((x) => (
        <ListItem
          key={x.name}
          name={x.name}
          path={x.path}
          childItems={x.childItems}
        />
      ))}
    </div>
  );
}

// `links` at the bottom, so that long `links` do not require you
// scrolling down to the bottom of the editor
const links = [
  {
    name: "哺乳類",
    path: "/animals",
    childItems: [
      {
        目: "ウサギ目",
        name: "ウサギ目",
        path: "/animals",
        childItems: [
          {
            類: "哺乳類",
            目: "ウサギ目",
            動物名: "アメリカンファジーロップイヤー",
            name: "アメリカンファジーロップイヤー",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "ウサギ目",
            動物名: "イングリッシュアンゴラ",
            name: "イングリッシュアンゴラ",
            path: "/aaa",
          },
        ],
      },
      {
        目: "ウマ目",
        name: "ウマ目",
        path: "/animals",
        childItems: [
          {
            類: "哺乳類",
            目: "ウマ目",
            動物名: "ミニチュアホース",
            name: "ミニチュアホース",
            path: "/aaa",
          },
        ],
      },
      {
        目: "カンガルー目",
        name: "カンガルー目",
        path: "/animals",
        childItems: [
          {
            類: "哺乳類",
            目: "カンガルー目",
            動物名: "フクロシマリス",
            name: "フクロシマリス",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "カンガルー目",
            動物名: "フクロモモンガ",
            name: "フクロモモンガ",
            path: "/aaa",
          },
        ],
      },
      {
        目: "ハイラックス目",
        name: "ハイラックス目",
        path: "/animals",
        childItems: [
          {
            類: "哺乳類",
            目: "ハイラックス目",
            動物名: "ケープハイラックス",
            name: "ケープハイラックス",
            path: "/aaa",
          },
        ],
      },
      {
        name: "奇蹄目",
        path: "/animals",
        childItems: [
          {
            類: "哺乳類",
            目: "奇蹄目",
            動物名: "アメリカバク",
            name: "アメリカバク",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "奇蹄目",
            動物名: "ウマ",
            name: "ウマ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "奇蹄目",
            動物名: "ポニー",
            name: "ポニー",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "奇蹄目",
            動物名: "マレーバク",
            name: "マレーバク",
            path: "/aaa",
          },
        ],
      },
      {
        name: "偶蹄目",
        path: "/animals",
        childItems: [
          {
            類: "哺乳類",
            目: "偶蹄目",
            動物名: "アクシスジカ",
            name: "アクシスジカ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "偶蹄目",
            動物名: "アルパカ",
            name: "アルパカ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "偶蹄目",
            動物名: "クビワペッカリー",
            name: "クビワペッカリー",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "偶蹄目",
            動物名: "コビトカバ",
            name: "コビトカバ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "偶蹄目",
            動物名: "コリデール",
            name: "コリデール",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "偶蹄目",
            動物名: "プーズー",
            name: "プーズー",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "偶蹄目",
            動物名: "フタコブラクダ",
            name: "フタコブラクダ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "偶蹄目",
            動物名: "ミニブタ",
            name: "ミニブタ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "食肉目",
        path: "/animals",
        childItems: [
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "アメリカクロクマ",
            name: "アメリカクロクマ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "アライグマ",
            name: "アライグマ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "クーガー（ピューマ）",
            name: "クーガー（ピューマ）",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "ゴールデンレトリバー",
            name: "ゴールデンレトリバー",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "コツメカワウソ",
            name: "コツメカワウソ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "ゴマフアザラシ",
            name: "ゴマフアザラシ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "サーバル",
            name: "サーバル",
            path: "/animals/serval",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "シマスカンク",
            name: "シマスカンク",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "シンリンオオカミ",
            name: "シンリンオオカミ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "スナドリネコ",
            name: "スナドリネコ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "スナネコ",
            name: "スナネコ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "スマトラトラ",
            name: "スマトラトラ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "ニュージーランドハンタウェイ",
            name: "ニュージーランドハンタウェイ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "ビントロング",
            name: "ビントロング",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "フェネック",
            name: "フェネック",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "ブッシュドッグ（ヤブイヌ）",
            name: "ブッシュドッグ（ヤブイヌ）",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "ブリタニースパニエル",
            name: "ブリタニースパニエル",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "ボーダーコリー",
            name: "ボーダーコリー",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "マヌルネコ",
            name: "マヌルネコ",
            path: "/animals/manul-cat",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "ミナミアメリカオットセイ",
            name: "ミナミアメリカオットセイ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "ラブラドールレトリバー",
            name: "ラブラドールレトリバー",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "食肉目",
            動物名: "レッサーパンダ",
            name: "レッサーパンダ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "被甲目",
        path: "/animals",
        childItems: [
          {
            類: "哺乳類",
            目: "被甲目",
            動物名: "マタコミツオビアルマジロ",
            name: "マタコミツオビアルマジロ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "有袋目",
        path: "/animals",
        childItems: [
          {
            類: "哺乳類",
            目: "有袋目",
            動物名: "アカカンガルー",
            name: "アカカンガルー",
            path: "/aaa",
          },
        ],
      },
      {
        name: "有毛目",
        path: "/animals",
        childItems: [
          {
            類: "哺乳類",
            目: "有毛目",
            動物名: "フタユビナマケモノ",
            name: "フタユビナマケモノ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "有毛目",
            動物名: "ミナミコアリクイ",
            name: "ミナミコアリクイ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "霊長目",
        path: "/animals",
        childItems: [
          {
            類: "哺乳類",
            目: "霊長目",
            動物名: "コモンマーモセット",
            name: "コモンマーモセット",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "霊長目",
            動物名: "ショウガラゴ",
            name: "ショウガラゴ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "霊長目",
            動物名: "ピグミーマーモセット",
            name: "ピグミーマーモセット",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "霊長目",
            動物名: "レッサースローロリス",
            name: "レッサースローロリス",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "霊長目",
            動物名: "ワオキツネザル",
            name: "ワオキツネザル",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "霊長目",
            動物名: "ワタボウシタマリン",
            name: "ワタボウシタマリン",
            path: "/aaa",
          },
        ],
      },
      {
        name: "齧歯目",
        path: "/animals",
        childItems: [
          {
            類: "哺乳類",
            目: "齧歯目",
            動物名: "アマミトゲネズミ",
            name: "アマミトゲネズミ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "齧歯目",
            動物名: "アメリカビーバー",
            name: "アメリカビーバー",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "齧歯目",
            動物名: "ウスイロホソオクモネズミ",
            name: "ウスイロホソオクモネズミ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "齧歯目",
            動物名: "オグロプレーリードッグ",
            name: "オグロプレーリードッグ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "齧歯目",
            動物名: "カピバラ",
            name: "カピバラ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "齧歯目",
            動物名: "ニホンモモンガ",
            name: "ニホンモモンガ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "齧歯目",
            動物名: "ニホンリス",
            name: "ニホンリス",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "齧歯目",
            動物名: "マーラ",
            name: "マーラ",
            path: "/aaa",
          },
          {
            類: "哺乳類",
            目: "齧歯目",
            動物名: "モルモット",
            name: "モルモット",
            path: "/aaa",
          },
        ],
      },
    ],
  },
  {
    name: "爬虫類",
    path: "/animals",
    childItems: [
      {
        name: "カメ目",
        path: "/animals",
        childItems: [
          {
            類: "爬虫類",
            目: "カメ目",
            動物名: "アルダブラゾウガメ",
            name: "アルダブラゾウガメ",
            path: "/aaa",
          },
          {
            類: "爬虫類",
            目: "カメ目",
            動物名: "スッポンモドキ",
            name: "スッポンモドキ",
            path: "/aaa",
          },
          {
            類: "爬虫類",
            目: "カメ目",
            動物名: "ホウシャガメ",
            name: "ホウシャガメ",
            path: "/aaa",
          },
          {
            類: "爬虫類",
            目: "カメ目",
            動物名: "ワニガメ",
            name: "ワニガメ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "ワニ目",
        path: "/animals",
        childItems: [
          {
            類: "爬虫類",
            目: "ワニ目",
            動物名: "ブラジルカイマン",
            name: "ブラジルカイマン",
            path: "/aaa",
          },
        ],
      },
      {
        name: "有鱗目",
        path: "/animals",
        childItems: [
          {
            類: "爬虫類",
            目: "有鱗目",
            動物名: "グリーンイグアナ",
            name: "グリーンイグアナ",
            path: "/aaa",
          },
          {
            類: "爬虫類",
            目: "有鱗目",
            動物名: "ビルマニシキヘビ",
            name: "ビルマニシキヘビ",
            path: "/aaa",
          },
          {
            類: "爬虫類",
            目: "有鱗目",
            動物名: "ミヤコカナヘビ",
            name: "ミヤコカナヘビ",
            path: "/aaa",
          },
        ],
      },
    ],
  },
  {
    name: "魚類",
    path: "/animals",
    childItems: [
      {
        name: "アロワナ目",
        path: "/animals",
        childItems: [
          {
            類: "魚類",
            目: "アロワナ目",
            動物名: "ピラルクー",
            name: "ピラルクー",
            path: "/aaa",
          },
        ],
      },
      {
        name: "カラシン目",
        path: "/animals",
        childItems: [
          {
            類: "魚類",
            目: "カラシン目",
            動物名: "コロソマ",
            name: "コロソマ",
            path: "/aaa",
          },
          {
            類: "魚類",
            目: "カラシン目",
            動物名: "ピラニアナッテリー",
            name: "ピラニアナッテリー",
            path: "/aaa",
          },
        ],
      },
      {
        name: "スズキ目",
        path: "/animals",
        childItems: [
          {
            類: "魚類",
            目: "スズキ目",
            動物名: "フラミンゴシクリッド",
            name: "フラミンゴシクリッド",
            path: "/aaa",
          },
        ],
      },
    ],
  },
  {
    name: "鳥類",
    path: "/animals",
    childItems: [
      {
        name: "エボシドリ目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "エボシドリ目",
            動物名: "ニシムラサキエボシドリ",
            name: "ニシムラサキエボシドリ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "エボシドリ目",
            動物名: "ハイイロエボシドリ",
            name: "ハイイロエボシドリ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "オウム目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "オウム目",
            動物名: "アカコンゴウインコ",
            name: "アカコンゴウインコ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "オウム目",
            動物名: "オオバタン",
            name: "オオバタン",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "オウム目",
            動物名: "キバタン",
            name: "キバタン",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "オウム目",
            動物名: "ヒワコンゴウインコ",
            name: "ヒワコンゴウインコ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "オウム目",
            動物名: "ベニコンゴウインコ",
            name: "ベニコンゴウインコ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "オウム目",
            動物名: "ルリコンゴウインコ",
            name: "ルリコンゴウインコ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "カモ目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "カモ目",
            動物名: "アカツクシガモ",
            name: "アカツクシガモ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "カモ目",
            動物名: "オシドリ",
            name: "オシドリ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "カモ目",
            動物名: "クビワコガモ",
            name: "クビワコガモ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "カモ目",
            動物名: "ツクシガモ",
            name: "ツクシガモ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "カモ目",
            動物名: "マガモ",
            name: "マガモ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "キジ目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "キジ目",
            動物名: "カンムリシャコ",
            name: "カンムリシャコ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "キツツキ目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "キツツキ目",
            動物名: "シロムネオオハシ",
            name: "シロムネオオハシ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "コウノトリ目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "コウノトリ目",
            動物名: "アフリカハゲコウ",
            name: "アフリカハゲコウ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "タカ目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "タカ目",
            動物名: "エジプトハゲワシ",
            name: "エジプトハゲワシ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "タカ目",
            動物名: "オーストラリアガマグチヨタカ",
            name: "オーストラリアガマグチヨタカ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "タカ目",
            動物名: "シロオオタカ",
            name: "シロオオタカ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "タカ目",
            動物名: "ハリスホーク",
            name: "ハリスホーク",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "タカ目",
            動物名: "ヒメコンドル",
            name: "ヒメコンドル",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "タカ目",
            動物名: "ワシノスリ",
            name: "ワシノスリ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "チドリ目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "チドリ目",
            動物名: "インカアジサシ",
            name: "インカアジサシ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "チドリ目",
            動物名: "クロエリセイタカシギ",
            name: "クロエリセイタカシギ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "チドリ目",
            動物名: "シロクロゲリ",
            name: "シロクロゲリ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "ハト目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "ハト目",
            動物名: "オウギバト",
            name: "オウギバト",
            path: "/aaa",
          },
        ],
      },
      {
        name: "ハヤブサ目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "ハヤブサ目",
            動物名: "オナガハヤブサ",
            name: "オナガハヤブサ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "ハヤブサ目",
            動物名: "ラナーハヤブサ",
            name: "ラナーハヤブサ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "フクロウ目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "フクロウ目",
            動物名: "オオフクロウ",
            name: "オオフクロウ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "フクロウ目",
            動物名: "クロワシミミズク",
            name: "クロワシミミズク",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "フクロウ目",
            動物名: "トルクメニアンワシミミズク",
            name: "トルクメニアンワシミミズク",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "フクロウ目",
            動物名: "メンフクロウ",
            name: "メンフクロウ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "ブッポウソウ目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "ブッポウソウ目",
            動物名: "ベニハチクイ",
            name: "ベニハチクイ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "フラミンゴ目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "フラミンゴ目",
            動物名: "ヨーロッパフラミンゴ",
            name: "ヨーロッパフラミンゴ",
            path: "/aaa",
          },
        ],
      },
      {
        name: "ペリカン目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "ペリカン目",
            動物名: "アフリカクロトキ",
            name: "アフリカクロトキ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "ペリカン目",
            動物名: "アフリカヘラサギ",
            name: "アフリカヘラサギ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "ペリカン目",
            動物名: "ショウジョウトキ",
            name: "ショウジョウトキ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "ペリカン目",
            動物名: "シロトキ",
            name: "シロトキ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "ペリカン目",
            動物名: "ハシビロコウ",
            name: "ハシビロコウ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "ペリカン目",
            動物名: "ヒロハシサギ",
            name: "ヒロハシサギ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "ペリカン目",
            動物名: "ベニヘラサギ",
            name: "ベニヘラサギ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "ペリカン目",
            動物名: "ミゾゴイ",
            name: "ミゾゴイ",
            path: "/aaa",
          },
          {
            類: "鳥類",
            目: "ペリカン目",
            動物名: "モモイロペリカン",
            name: "モモイロペリカン",
            path: "/aaa",
          },
        ],
      },
      {
        name: "ペンギン目",
        path: "/animals",
        childItems: [
          {
            類: "鳥類",
            目: "ペンギン目",
            動物名: "ケープペンギン",
            name: "ケープペンギン",
            path: "/aaa",
          },
        ],
      },
    ],
  },
];
